# Core cross-platform extensions you actually use
andreoneti.qml-formatter
charliermarsh.ruff
continue.continue
davidanson.vscode-markdownlint
foxundermoon.shell-format
manishsencha.readme-preview
mkhl.shfmt
ms-python.python
ms-vscode.makefile-tools
ms-vscode.powershell
pycom.pymakr

nomicfoundation.hardhat-solidity

dart-code.flutter
dart-code.dart-code
ricardo-emerson.dart-data-class-tools

mads-hartmann.bash-ide-vscode
ms-vscode.cpptools
rust-lang.rust-analyzer
golang.go
dbaeumer.vscode-eslint
redhat.vscode-yaml
ms-azuretools.vscode-docker

# Python helper extensions – installed automatically by ms-python.python
# (you don't need these in the list unless you want to force them explicitly)
# ms-python.debugpy
# ms-python.vscode-pylance
# ms-python.vscode-python-envs

# Heavy / AI / mostly-Windows-focused tooling – optional
# ms-windows-ai-studio.windows-ai-studio
# teamsdevapp.vscode-ai-foundry

# Notes you had embedded as comments (kept for your reference)
# go install mvdan.cc/sh/v3/cmd/shfmt@latest
# winget install -e --id mvdan.shfmt
# ms-azuretools.vscode-azureresourcegroups
# ms-azuretools.vscode-containers
